#include <iostream>
#include "Menu.h"    // підключаємо лише папку яку викликаємо у int main()
using namespace std;
/*Написати функції для роботи з динамічним одновимірним масивом :
Функція створення динамічного масиву вказаного розміру і його заповнення випадковими числами.
Виводу масиву
Доповнення масиву одним елементом. Функція отримує адресу масиву, розмір та елемент для доповнення.
Видалення елемента за вказаною позицією.
Вставка нового елемента у довільну допустиму позицію у масиві
Меню
(розбити проект на файл основної програми(.cpp), файл реалізації функцій(.cpp) та заголовочний файл(.h)).*/
int main() {
	int* arr;
	Menu(arr);
	system("pause");
	return 0;
}