#include <iostream>
#include <ctime>
#include "FillArr.h"
#include "PrintArr.h"
using namespace std;
/*Написати функції для роботи з динамічним одновимірним масивом :
Функція створення динамічного масиву вказаного розміру і його заповнення випадковими числами.
Виводу масиву
Доповнення масиву одним елементом.Функція отримує адресу масиву, розмір та елемент для доповнення.
Видалення елемента за вказаною позицією.
Вставка нового елемента у довільну допустиму позицію у масиві
Меню
(розбити проект на файл основної програми(.cpp), файл реалізації функцій(.cpp) та заголовочний файл(.h)).*/
int main() {
	int size;
	cout << " Enter array size:  ";
	cin >> size;
	int *arr = new int[size];
	FillArr(arr, size);
	PrintArr(arr, size);
	delete[]arr;
	system("pause");
	return 0;
}