/*  Написати програму, яка отримує від користувача довільний набір cимволів, шифрує його та виводить на екран новоутворений рядок.
    Для шифрування скористатись звичайними арифметичними операціями ++, --, збільшення або зменшення на якесь число тощо.
	Наприклад, при введенні ABА на екрані буде ВСВ. */

#include <iostream>
using namespace std;
int main() {
	char text[255];  // оголошуємо змінну в яку можна записати текст
	cout << "Enter your text:\n----------------" << endl;

	cin.getline(text, 255);   // Щоб зчитувало текст з пробілами (Замість   cin >> text;  )
	cout << text << endl;
	

	for (int i = 0; i < strlen(text); i++)
	{
		text[i] = text[i]++;
	}
	cout << "===========================================" << endl;
	cout << "Encrypted text:\n---------------\n" << text << endl;
	

	for (int i = 0; i < strlen(text); i++)
	{
		text[i] = text[i]--;
	}
	cout << "===========================================" << endl;
	cout <<  "Decoded text:\n-------------\n" << text << endl;
	cout << "===========================================" << endl;
	system("pause");
	return 0;
 }